/*===================================================================================
*    Date : 2023/01/18(土)
*        Author		: Gakuto.S
*        File		: Keyboard.h
*        Detail		:
===================================================================================*/
#include <Windows.h>

class Keyboard
{
public:
	//**************************************************
	/// \brief キーの入力更新
	/// 
	/// \return なし
	//**************************************************
	static void SetKeyState(BYTE* state);

	//**************************************************
	/// \brief キーの入力
	/// 
	/// \return なし
	//**************************************************
	static bool Press(int key);

	//**************************************************
	/// \brief キーの入力
	/// 
	/// \return なし
	//**************************************************
	static bool Trigger(int key);

	//**************************************************
	/// \brief キーの入力
	/// 
	/// \return なし
	//**************************************************
	static bool Release(int key);

public:
	static constexpr int k_KEY_NUM = 256;

private:
	static BYTE m_curretnState[k_KEY_NUM];
	static BYTE m_oldState[k_KEY_NUM];
};