/*===================================================================================
*    Date : 2022/01/20(金)
*        Author		: Gakuto.S
*        File		: IF_Sound.h
*        Detail		:
===================================================================================*/
#pragma once
#include <map>
#include <vector>

#include "IF_SoundController.h"

class ISound
{
public:
    //**************************************************
    /// \brief 更新処理
    /// 
    /// \return なし
    //**************************************************
	virtual void Update() = 0;

    //**************************************************
    /// \brief 生成処理
    /// 
    /// \return なし
    //**************************************************
    virtual ISoundController* CreateSoundController(
        const char* fileName,
        bool stream = false
    ) = 0;

    //**************************************************
    /// \brief 解放処理
    /// 
    /// \return なし
    //**************************************************
    virtual void DestroySoundController(ISoundController* controller) = 0;

    //**************************************************
    /// \brief 停止中のデータを再生する処理
    /// 
    /// \return なし
    //**************************************************
    virtual void Play() = 0;

    //**************************************************
    /// \brief 再生中のデータを止める処理
    /// 
    /// \return なし
    //**************************************************
    virtual void Stop() = 0;
};

