/*===================================================================================
*    Date : 2022/01/21(土)
*        Author		: Gakuto.S
*        File		: IF_Audio.h
*        Detail		:
===================================================================================*/
#pragma once

class ISoundController
{
public:
    //**************************************************
    /// \brief コンストラクタ
    /// 
    /// \return なし
    //**************************************************
    ISoundController(
        bool streaming,
        size_t id
    )
        :m_controlID(id),
        m_stream(streaming),
        m_running(false)
    {}

    //**************************************************
    /// \brief デストラクタ
    /// 
    /// \return なし
    //**************************************************
    virtual ~ISoundController() {}

public:
    //**************************************************
    /// \brief 再生処理
    /// 
    /// \return なし
    //**************************************************
	virtual void Play() = 0;

    //**************************************************
    /// \brief 停止処理
    /// 
    /// \return なし
    //**************************************************
	virtual void Stop() = 0;

    //**************************************************
    /// \brief 音量調整
    /// 
    /// \param[in] volume 0 ~ 100
    /// 
    /// \return なし
    //**************************************************
    virtual void SetVolume(unsigned int volume) = 0;

    //**************************************************
    /// \brief 状態取得
    /// 
    /// \return true なら再生中
    //**************************************************
    bool GetRunning() { return m_running; }

public:
    const bool		m_stream;
    const size_t	m_controlID;

protected:
    bool            m_running;
};

