/*===================================================================================
*    Date : 2022/11/29(火)
*        Author		: Gakuto.S
*        File		: IF_ShaderResource.h
*        Detail		:
===================================================================================*/
#pragma once
#include "IF_BufferObject.h"

class IShaderResource
{
public:
	//**************************************************
	/// \brief デストラクタ
	/// 
	/// \return なし
	//**************************************************
	virtual ~IShaderResource() {}

	//**************************************************
	/// \brief マップ
	/// 
	/// \return true なら成功
	//**************************************************
	virtual bool Map(void* data, size_t size) = 0;
};

