/*===================================================================================
*    Date : 2023/01/14(土)
*        Author		: Gakuto.S
*        File		: Object_Pin_Ans.h
*        Detail		:
===================================================================================*/
#pragma once
#include "IF_ObjectGLTF.h"

class ObjectPinAns : public IObjectGLTF
{
public:
	enum class ANSWER
	{
		NONE,
		HIT,
		BROW
	};


public:
	//**************************************************
	/// \brief コンストラクタ
	/// 
	/// \return なし
	//**************************************************
	ObjectPinAns(ANSWER type)
		:m_type(type)
	{}

	//**************************************************
	/// \brief 初期化処理
	/// 
	/// \return なし
	//**************************************************
	void Init() override;

	//**************************************************
	/// \brief 描画処理
	/// 
	/// \return なし
	//**************************************************
	void Draw() override;

private:
	//**************************************************
	/// \brief 色を返す
	/// 
	/// \return なし
	//**************************************************
	DirectX::XMFLOAT4 getColor();

private:
	const ANSWER m_type;
};

